Repository: MichiHill1991/cos_challenge
Catalog: lib/l10n/app_*.arb
Languages: de

# email
source: Mail address
de: E-Mail-Adresse

source: Password
de: Passwort

# acceptPrivacy
source: I accept the Privacy Policy
de: Ich akzeptiere die Datenschutzerklärung

source: Login failed
de: Login fehlgeschlagen

# loginErrorInvalidMail
source: Invalid mail address
de: Ungültige E-Mail

# loginErrorCharacterLength
source: At least 6 character
de: Mindestens 6 Zeichen

# loginErrorEmailEmpty
source: Please enter your mail address
de: Bitte E-Mail-Adresse angeben

# loginErrorPasswordEmpty
source: Please enter password
de: Bitte Password angeben

# loginErrorPrivacy
source: Please accept our Privacy Policy
de: Bitte akzeptieren Sie die Datenschutzerklärung

# loginServerError400
source: Please check your input.
de: Überprüfen Sie bitte Ihre Eingaben.

# loginServerError401
source: Please check your input.
de: Überprüfen Sie bitte Ihre Eingaben.

# loginServerError403
source: You are not authorized to access this page.
de: Sie haben keine Berechtigung für diese Seite.

# loginServerError500
source: An unknown server error occurred. Please contact support.
de: Ein unbekannter Serverfehler ist aufgetreten, bitte kontaktieren Sie den Support.

# termsOfUse01
source: I hereby confirm that I have read and accept the
de: Hiermit bestätige ich, dass ich gelesen habe und akzeptiere die

# termsOfUse02
source: T&C
de: ABG

# termsOfUse03
source: and the
de: und die

# termsOfUse04
source: Privacy Policy
de: Datenschutzrichtlinie

# termsOfUse05
source: of Castle Tech GmbH
de: der Castle Tech GmbH

# cardTitle
source: Car search
de: Fahrzeugsuche

# cardSubtitle
source: Please enter a valid VIN.
de: Bitte geben Sie eine gültige VIN ein.

# enterVin
source: chassis number (VIN)
de: Fahrgestellnummer (VIN)

source: Search
de: Suchen

# vinEmptyError
source: Please enter VIN.
de: Bitte geben Sie die VIN ein.

# vinLengthError
source: A VIN must be exactly 17 characters long.
de: Eine VIN muss genau 17 Zeichen lang sein.

# vinSearchSuccess
source: Car found!
de: Fahrzeug erfolgreich gefunden!

# vinSearchFailed
source: Car not found.
de: Fahrzeug konnte nicht gefunden werden.

# vinSearchError
source: Car could not be found. Please try again in {delaySeconds} seconds.
de: Fahrzeug konnte nicht gefunden werden. Bitte erneut versuchen in {delaySeconds} Sekunden.

# homeAuthException
source: Your session has expired, please log in again.
de: Ihre Session ist abgelaufen, bitte loggen Sie sich erneut ein.

# homeTimeoutException
source: Oops, our server seems to be taking a nap. Please Try again later.
de: Hoppala, unser Server scheint wohl ein Nickerchen zu machen. Versuchen Sie es später noch einmal.

# homeDeserializationException
source: Oops, the response from the server could not be read, please contact support.
de: Hoppala, die Antwort vom Server konnte nicht gelesen werden, bitte kontaktieren Sie den Support.

# multipleSelectorTitle
source: Multiple cars found
de: Fahrzeuge gefunden

# multipleSelectorSubTitle
source: Several suitable cars were found, please select the appropriate model.
de: Es wurden mehrere passende Fahrzeuge gefunden, bitte wählen Sie das passende Model.

# multipleSimilarityHigh
source: High similarity
de: Hohe Ähnlichkeit

# multipleSimilarityMedium
source: Medium similarity
de: Mittlere Ähnlichkeit

# multipleSimilarityLow
source: Low similarity
de: Geringe Ähnlichkeit

# appBarLogin
source: Log in
de: Anmelden

# appBarSearch
source: VIN search
de: VIN-Suche

# appBarMultipleChoice
source: Multiple results
de: Mehrere Treffer

# appBarAuction
source: Auction details
de: Auktionsdetails
